#-----------------------------------------
# Taps
#-----------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'oven-sh/bun'

#-----------------------------------------
# Dev Tools
#-----------------------------------------
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'diff-so-fancy'
brew 'git-extras'
brew 'vim'
brew 'wget'
brew 'yadm'
brew '1password-cli'

#-----------------------------------------
# App Casks
#-----------------------------------------
cask '1password'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'iterm2'
cask 'cron'
cask 'notion'
cask 'zoom'
cask 'arc'

#-----------------------------------------
# Docker
#-----------------------------------------
cask 'docker'

#-----------------------------------------
# NodeJS
#-----------------------------------------
brew 'pnpm'
brew 'yarn'
brew 'bun'
