#-----------------------------------------
# Taps
#-----------------------------------------
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'oven-sh/bun'
tap 'font-hack-nerd-font'
tap 'jesseduffield/lazygit/lazygit'

#-----------------------------------------
# Dev Tools
#-----------------------------------------
brew 'yadm'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'diff-so-fancy'
brew 'git-extras'
brew 'vim'
brew 'wget'
brew 'tmux'
brew 'ripgrep'
brew 'lazygit'

brew 'coreutils'
brew 'asdf'

#-----------------------------------------
# Casks
#-----------------------------------------
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'cursor'
cask 'bruno'
cask 'iterm2'
cask 'notion'
cask 'notion-calendar'
cask 'zoom'
cask 'arc'
cask 'karabiner-elements'
cask 'font-hack-nerd-font'

#-----------------------------------------
# Docker
#-----------------------------------------
cask 'docker'

#-----------------------------------------
# NodeJS
#-----------------------------------------
brew 'pnpm'
brew 'yarn'
