# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "github/gh"
tap "heroku/brew"
tap "teamookla/speedtest"

# Brew CLI apps
brew "diff-so-fancy"
brew "git-extras"
brew "hub"
brew "mas"
brew "netlify-cli", link: false
brew "speedtest"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "github/gh/gh"
brew "heroku/brew/heroku"
brew "zsh"

# App casks
cask "1password"
cask "alfred"
cask "discord"
cask "docker"
cask "fantastical"
cask "google-chrome"
cask "iterm2"
cask "krisp"
cask "macdown"
cask "postman"
cask "slack"
cask "spotify"
cask "spotify-notifications"
cask "steam"
cask "visual-studio-code"

# Mac App Store apps
mas "Bear", id: 1091189122
mas "Kindle", id: 405399194
mas "Xcode", id: 497799835
