# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "heroku/brew"

# Brew CLI apps
brew "diff-so-fancy"
brew "git-extras"
brew "heroku/brew/heroku"
brew "mas"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh"

# App casks
cask "1password"
cask "adoptopenjdk/openjdk/adoptopenjdk8"
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "krisp"
cask "macdown"
cask "notion"
cask "postico"
cask "postman"
cask "private-internet-access"
cask "rectangle"
cask "slack"
cask "spotify"
cask "spotify-notifications"

# Mac App Store apps
mas "Xcode", id: 497799835
