# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"

# Brew Apps
brew "mas"
brew "diff-so-fancy"
brew "git-extras"
brew "vim"
brew "wget"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh"
brew "slack"
brew "spotify"
brew "zoom"

# App casks
cask "discord"
cask "firefox"
cask "alfred"
cask "google-chrome"
cask "krisp"
cask "notion"
cask "postico"
cask "postman"
cask "private-internet-access"
cask "rectangle"

# Mac app store
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
